; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	image1 - mode
	infrared2 - mode
	image3 - mode
	spectrograph0 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star7 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation10 - direction
	Star2 - direction
	GroundStation6 - direction
	GroundStation11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation11)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation11)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
)
(:goal (and
	(pointing satellite2 GroundStation3)
	(have_image Star12 image3)
	(have_image Planet13 spectrograph0)
	(have_image Phenomenon14 image3)
	(have_image Planet15 infrared2)
	(have_image Star16 image1)
))

)

; plan
1. (turn_to satellite2 groundstation11 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 groundstation11)
   goals met: 0 of 6
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 6
3. (calibrate satellite2 instrument2 groundstation11)
   added: (calibrated instrument2)
   goals met: 0 of 6
4. (turn_to satellite2 planet15 groundstation11)
   deleted: (pointing satellite2 groundstation11)
   added: (pointing satellite2 planet15)
   goals met: 0 of 6
5. (take_image satellite2 planet15 instrument2 infrared2)
   added: (have_image planet15 infrared2)
   goals met: 1 of 6
6. (turn_to satellite2 planet13 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet13)
   goals met: 1 of 6
7. (take_image satellite2 planet13 instrument2 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 2 of 6
8. (turn_to satellite2 phenomenon14 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 phenomenon14)
   goals met: 2 of 6
9. (take_image satellite2 phenomenon14 instrument2 image3)
   added: (have_image phenomenon14 image3)
   goals met: 3 of 6
10. (turn_to satellite2 star12 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 star12)
   goals met: 3 of 6
11. (take_image satellite2 star12 instrument2 image3)
   added: (have_image star12 image3)
   goals met: 4 of 6
12. (turn_to satellite2 star16 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star16)
   goals met: 4 of 6
13. (take_image satellite2 star16 instrument2 image1)
   added: (have_image star16 image1)
   goals met: 5 of 6
14. (turn_to satellite2 groundstation3 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 groundstation3)
   goals met: 6 of 6
